In [2]:
import pandas as pd

In [3]:
print(pd.__version__) #check version of pandas

2.2.3

In [5]:
A = pd.Series(['Amina', 'Aminu', 'Umar'],index = ['a', 'b', 'c']) #create a series with index
A

a    Amina
b    Aminu
c     Umar
dtype: object

In [6]:
A['b'] #access an element with index b

'Aminu'

In [7]:
A['b':'c'] #print elements from index b to c

b    Aminu
c     Umar
dtype: object

In [16]:
grades = {'A': 80, 'B': 75, 'C': 50, 'D': 40} #a dic
grades_pd = pd.Series(grades) #create a pd series with a dic
grades_pd

A    80
B    75
C    50
D    40
dtype: int64

In [20]:
marks = {'A': 20, 'B':34, 'C': 12, 'D': 90, }
marks_pd = pd.Series(marks)
marks_pd

A    20
B    34
C    12
D    90
dtype: int64

In [49]:
D = pd.DataFrame({'Grades': grades_pd, 'Marks': marks_pd}) #creating Dataframe from dictionery
D

   Grades  Marks
A      80     20
B      75     34
C      50     12
D      40     90

In [22]:
D.T #D transpose

         A   B   C   D
Grades  80  75  50  40
Marks   20  34  12  90

In [23]:
D.values #values in D

array([[80, 20],
       [75, 34],
       [50, 12],
       [40, 90]], dtype=int64)

In [28]:
D.values[3, 1] #access values at index [3, 1]

90

In [30]:
D.columns #columns in D

Index(['Grades', 'Marks'], dtype='object')

In [45]:
D['percentage'] =  100*(D['Marks']/50) #added a column with percentage
D

   Grades  Marks  percentage
A      80     20        40.0
B      75     34        68.0
C      50     12        24.0
D      40     90       180.0

In [46]:
del D['percentage'] #delete percentage column

In [47]:
D

   Grades  Marks
A      80     20
B      75     34
C      50     12
D      40     90

# Reading in Files

In [4]:
df = pd.read_csv(r"C:\Users\Amina\Desktop\learning Python with Jupyter\sample_data.csv") #read a csv file

In [5]:
df

      Name  Age         City  Salary
0    Alice   23     New York   70000
1      Bob   34  Los Angeles   80000
2  Charlie   29      Chicago   75000
3    David   40      Houston   90000
4      Eva   22      Phoenix   72000